Notes/daily/2021-10-24.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-24 Sun 10:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021-10-24</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org12527a0">Today's task list</a></li>
</ul>
</div>
</div>

<div id="outline-container-org12527a0" class="outline-2">
<h2 id="org12527a0">Today's task list</h2>
<div class="outline-text-2" id="text-org12527a0">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Dates (perhaps modification dates?) on the pages would be nice, currently they just show the titles</li>
<li class="off"><code>[&#xa0;]</code> The rest of the work from notion needs to be transferred over</li>
<li class="off"><code>[&#xa0;]</code> Links to the website need to be added to the class notebook &amp; onedrive folder</li>
<li class="off"><code>[&#xa0;]</code> Links to the sitemap &amp; other useful pages, as well as a short description need to be added to the main homepage</li>
<li class="off"><code>[&#xa0;]</code> The notes homepage should no longer be called homepage</li>
<li class="off"><code>[&#xa0;]</code> Templates should be created for daily diary notes</li>
</ul>

<p>
To start off today I've copied over the task-list of tasks I didn't complete yesterday, and I'm going to have a go at finishing as many as possible in 2 hours. It's still mostly setup/busywork, so there's not a whole lot to document, but I'll write down useful stuff here as well as make commits to the repository.
</p>


<p>
As a first task, I'm going to sort out the homepage of the website; I've decided to have the sitemap on the homepage (at the bottom so that it's easy to find links to everywhere. Other things I'll include on the homepage are as follows:
</p>
<ul class="org-ul">
<li>A short description of who I am, likely stolen from a private self-describing notion note</li>
<li>A short description of what the EPQ is)</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-10-24 Sun 10:58</p>
</div>
</body>
</html>
